ConvertToIndependent Method
 Convert the dependent view to independent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void ConvertToIndependent()
Visual Basic
Public Sub ConvertToIndependent
Visual C++
public:
void ConvertToIndependent()
Remarks
 This method can be only applied to a dependent view. A dependent view can be created from another view using method View.Duplicate(ViewDuplicateOption.AsDependent). Dependent views have a valid primary view element ID that can be obtained via method View.GetPrimaryViewId(); Independent views have InvalidElementId as their primary view ID.
Examples
CopyC#
public void MakeViewIndependent(View view)
{
    // Independent views will have an InvalidElementId for the Primary View Id
    if (view.GetPrimaryViewId() != ElementId.InvalidElementId)
    {
        view.ConvertToIndependent();
    }
}
CopyVB.NET
Public Sub MakeViewIndependent(view As View)
    ' Independent views will have an InvalidElementId for the Primary View Id
    If view.GetPrimaryViewId() <> ElementId.InvalidElementId Then
        view.ConvertToIndependent()
    End If
End Sub
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException |  This view is not dependent.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →